---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.ZoomType
source: html/cb2bd8d8-5080-61ed-1fda-fee4ca683a61.htm
---
# Autodesk.Revit.DB.PrintParameters.ZoomType Property

The zoom type.

## Syntax (C#)
```csharp
public ZoomType ZoomType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when the input argument is out of range.